Repository: okhin/Eclipse-Phase-French-Translation
Catalog: eclipsephase/OmegaT+/project.tmx
Source language: en_us
Languages: fr_fr

source: Such effects can apply a –10 to –30 modifier to Perception Tests and other actions, but the user can also adjust their filters and/or turn their AR off if necessary.
fr_fr: De tels effets peuvent appliquer un modificateur de -10 aux Tests de Perception et d'autres actions, mais l'utilisateur peut également ajuster ses filtres et/ou désactiver sa RA si nécessaire.

source: A backdoor is a method of bypassing a system's normal authentication and security features.
fr_fr: Une backdoor est une méthode de contourner l'identificaton normale d'un système et ses fonctions de sécurité.

source: It enables a hacker to sneak into a system by exploiting a flaw (which can take the form of an installed program or modification to an existing program or hardware device) that was integrated into the system previously, either by themself or another hacker (who shared the backdoor).
fr_fr: Cela donne à un hackeur la possibilité de s'infiltrer dans un système en exploitant un défaut (qui peut prendre la forme d'un programme installé, de modification d'un programme existant ou d'un appareil matériel) qui a été précédemment intégré au système, soit par lui-même soit par un autre hackeur (qui aprtage la backdoor).

source: To install a backdoor, the hacker must successfully infiltrate the system and succeed in both a Programming and an Infosec Test (or an Opposed Infosec Test if the system is actively monitored).
fr_fr: Pour installer une backdoor, le hackeur doit réussir à infiltrer le système et réussir un Test de Programmation et un Tets d'Infosec (ou un Test en Opposition si le système est activement supervisé).

source: The Programming Test determines how well the backdoor is crafted and hidden within system processes, while the Infosec Test represents incorporating it into the system without security noticing.
fr_fr: Le Test de Programmation détermine la qualité de la backdoor et sa dissimulation dans les processuss système, alors que le test d'Infosec représente l'incorporation de cette backdoor dans le système sans que la sécurité ne la remarque.

source: Modify the Programming Test by –20 if the hacker wants to have security privileges when using the backdoor, –30 for admin.
fr_fr: Modifier le test de Programmation de -20 si le hackeur veux avoir des privilèges de sécurité, et de -30 pour être admin, en utilisant la backdoor.

source: Once installed, using a backdoor requires no test to access the system—the hacker simply logs on as if they were a legitimate user, gaining Covert status.
fr_fr: une fois installée, utiliser une backdoor ne nécessite aucun test pour accéder au système - le hackeur se connecte simplement comme si il était un utilisateur légitome, et obtient le status Couvert.

source: Anyone who is aware of a backdoor's details may use it.
fr_fr: Quiconque connaît les détails de la backdoor peut l'utiliser.

source: How long the backdoor lasts depends on many factors and is largely up to the gamemaster.
fr_fr: La durée pendant laquelle la backdoor persistera dépend de plusieurs facteurs et est laisser à l'appréiation du maître de jeu.

source: Backdoors are only likely to be spotted during complete security audits, so more paranoid systems are likely to detect them earlier.
fr_fr: Les backdoors ne serotn géénralement détecté que pendant des audits de sécurité complet, les systèmes les plus paranoïaque les détecterons donc plus rapidement.

source: Security audits may also occur when an intruder is Spotted but never Locked.
fr_fr: Les audits de sécurité peuvent également avoir lieu lorsqu'un intrus est Détecté et qu'il n'est jamais Verrouillé.

source: Security audits are a Task Action with a timeframe of 24 hours.
fr_fr: Les audits de sécurité sont une Action de Tâche avec un intervalle de 24 heure.

source: The character conducting the audit makes an Infosec Test to spot the back door.
fr_fr: Le personnage qui mène l'audit fait un Test d'Infosec pour remarquer la backdoor.

source: If the backdoor's installer scored an Excellent Success on their Programming Test, this Infosec Test suffers a –30 modifier.
fr_fr: Si l'installeur de la backdoor a obtenu une Réussite Exceptionnelle sur leur test de Programmation, ce test d'Infosec subit un modificateur de -30.

source: Intruders can attempt to crash software programs by killing the processes that run them.
fr_fr: Le sintrus peuvent tenter de planter un logiciel en terminant les processuss qui les exécutent.

source: Note that some software is set to immediately respawn, but this can take from 1 Action turn to 1 minute, depending on the system.
fr_fr: Notez que certains logiciels sont configurés pour être relancés automatiquement, mais cela peut mettre entre 1 Tour d'Action et 1 minute, en fonction du système.

source: Hackers may crash AIs, AGIs, and even infomorphs this way, but the process is more difficult.
fr_fr: Les hackeurs peuvent planter les IA, les IAG et même les infomorphs de cette manière, mais le mode opératoire est plus difficile.

source: In this case, an Opposed Infosec Test is made against the target, who is immediately aware they are under attack.
fr_fr: Dans ce cas, un Test en Opposition d'Infosec est fait contre la cible, qui est immédiatement consciente de l'attaque.

source: Two consecutive tests must succeed in order to crash an AI, three in order crash an AGI or infomorph.
fr_fr: Deux tests consécutifs doivent réussir avant de planter une IA, trois pour planter une IAG ou une infomorph.

source: If successful, the AI/infomorph immediately reboots, which generally takes 3 Action Turns, longer if the gamemaster chooses.
fr_fr: En cas de réussite, l'IA/infomorph redémarre immédiatement, ce qui prend générallement 3 Tours d'Action, plus si le maîþre de jeu le désire.

source: Hackers who have avoided being Locked may attempt to clean up all traces of their intrusion before they exit a system.
fr_fr: Les hackeurs qui ont évité d'être Verrouillé peuvent tenter de nettoyer les traces de leur intrusion avant de quitter un système.

source: This involves erasing incriminating data in the access and security logs, and otherwise hiding any evidence of system tampering.
fr_fr: Cela implique d'effacer les données incriminantes dans les logs d'accès et de sécurité, et de cacher les autres preuves de la compromission du système.

source: This requires a Complex Action and an Infosec Test, or an Opposed Infosec Test if the system is actively monitored.
fr_fr: Cela nécessite une Action Complexe et un test d'Infosec, ou un Test en Opposition d'Infosec si le système est activement supervisé.

source: If successful the intruder has wiped anything that might be used to track them down later, such as mesh ID, etc.
fr_fr: Si le test réussit, l'intrus a effacé tout ce qui aurait pu être utilisé pourle pister plus tard, tels que les ID mesh et autres.

source: Virtual private networks (VPNs) are more challenging to hack than standard devices.
fr_fr: Les réseaux privés virtuels (VPN) sont un peu plus complexe à pirater que les appareils standards.

source: Because they exist as an encrypted network within the mesh, accessing channels of communication within a VPN is all but impossible without the encryption key.
fr_fr: Comme ils existent en tant que réseaux chiffré à l'intérieur du mesh, accéder aux canaux de communication à l'intérieur d'un VPN est impossible sans la clef de chiffrement.

source: This means any attempt to sniff the VPN traffic is also impossible without the key.
fr_fr: Cela veut dire que toute tentative d'écouter le traffic du VPN est également impossible sans la clef.

source: The only way to hack a VPN is to hack into a device that is part of the VPN and running the VPN software.
fr_fr: La seule façon de pirater un VPN est de pénétrer un apapreil qui fait parti du VPN et d'exécuter le logiciel de VPN.

source: Once an intruder has access to such a device, they can attempt to access the VPN.
fr_fr: Une fois qu'un intrus à accès à un tel appareil, il peut tenter d'accéder au VPN.

source: The account the hacker has compromised may have VPN privileges, in which case they are in.
fr_fr: Le compte que le hackeur a compromis peut avoir des privilèges VN, ce qui signifie qu'ils ont pénétré le VPN.

source: If not, they must hack access, requiring an Infosec Test with a Minor modifier (–10).
fr_fr: Si ce n'est pas le cas, ils doivent pirater leur accès, ce qui nécessite un Test d'Infosec avec un modificateur Mineur (-10).

source: Once access to the VPN is acquired, the hacker may treat the VPN like any other network.
fr_fr: une fois que l'accès au VPn est acquis, le hackeur peut le considérer conmme n'importe quel autre réseau.

source: They may hack other devices on the VPN, sniff VPN traffic, track other users on the VPN, research data hidden away on the VPN, and so on.
fr_fr: Ils peuvent pirater d'autres apapreil sur le VPN, éouter du traffic VPN, pister d'autres utilisateurs du VPN, rechercher des données dissimulées sur le VPN et ainsi de suite.

source: A script is a simple program—a batch of instructions— that a hacker can embed in a system to be executed at a later pre-scheduled time or upon a certain trigger event, even without the hacker being present.
fr_fr: Un script est un progrmamme simple - une liste d'instruction - qu'un hackeur peur embarquer dans un système afin qu'il soit exécuter à un moment programmé ou selon certains conditions, sans même que le hackeur ne soit présent.

source: When activated, the script will undertake a number of system operations limited by the abilities of the operating system and the access rights the hacker had when they implemented the script in the system.
fr_fr: Lorsqu'il est activé, le script va s'occuper d'un certain nombre d'opérations système limité par les possibilités du système d'exploitation et des droits d'accès que le hackeur avait lorsqu'il a implémenté le script dans le système.

source: Scripts are
fr_fr: Les scripts sont

source: a great way for a hacker to subvert a system without necessarily being in danger when they do it.
fr_fr: une bonne manièr de subvertir un système sans être nécessairement en danger lorsqu'ils le font.

source: Scripts can be programmed on the fly or preprogrammed When composing the script, the character must detail what system operations the set will call for, in what order and at what times (or at what trigger steps).
fr_fr: Les scripts peuvent être programmés à la volée ou préprogrammés. Lorsqu'un personnage écrit un script, il doit détailler quelles opérations système seront faites, dans quel ordre et à quel moment (ou ce qui déclenche le tout).

source: The script cannot contain more steps/tasks than the character's Programming skill $$ 10 (round down).
fr_fr: Le script ne peut pas contenir plus d'étapes/de tâches que la compétence Programmation $$ 10 (arrondi à l'infoérieur) du personnage.

source: To program a script, the character must succeed in a Programming Test with a timeframe determined by the gamemaster.
fr_fr: Pour programmer un script, le personnage doit réussir un Test de Programmation avec un intervalle déterminé par le maître de jeu.

source: To load the script, the character must have successfully intruded in the system and must succeed in an Infosec Test (or an Opposed Infosec Test if the system is actively monitored).
fr_fr: Pour charger le script, le personnage doit s'être introduit avec succès dans le système et doit réussi un Test d'Infosec (ou un Test en Opposition d'Infosec si le système est activement supervisé).

source: If successful, the script is loaded into the system and will run as programmed.
fr_fr: En cas de réussite, le script est chargé dans le système et s'exécutera de la manière dont il a été programmé.

source: Once the script is activated, it carries out the preprogrammed sequence of actions.
fr_fr: Une fois que le script a été activé, il décelnche la séquence d'action pré-programmée.

source: The programmer's Infosec skill is used for any tests those actions call for.
fr_fr: La compétence Infosec du programmeur est utilisée pour tous les tests nécessaire à ces actions.

source: Inactivated scripts may be detected in a security audit, just like backdoors (p.
fr_fr: Les scripts inactifs peuvent être détectés par un audit de sécurité, de la mrme manière que les backdoors (p.

source: Expample
fr_fr: Exemple

source: Sarlo has infiltrated a security system and wants to arrange it so that a particular security sensor deactivates and a door unlocks at a set time, allowing his team to infiltrate a high-security area.
fr_fr: Sarlo a infiltré un système de sécurité et veut le préparer pour qu'un capetur de sécurité particulier se désactive et qu'une porte se déverouille à une heure configuré, permettant à son équipe d'infiltrer une zone de haute-sécurité.

source: He creates a script that will activate at 2200 hours with the following steps: At 2200 hours, disable security sensor Then unlock door At 2230 relock door Then re-enable security sensor Eliminate traces
fr_fr: Il crée un script qui s'activera à 22:00 avec les étapes suivantes: À 22:00, désactivation du cpateur de sécurité Puis déverouillage de la porte À 22:30 réactivation du capteur de sécurité Puis réactivation du capteur de sécurité Suppression des traces

source: This script has 5 steps, which Sarlo can handle with his Programming skill of 70.
fr_fr: Ce script a 5 étapes, ce que Sarlo peut gérer avec sa compétence Programmation de 70.

source: Sarlo succeeds in his Programming and Infosec Tests, and the script is loaded.
fr_fr: Il réussit ses Tests de Programmation et d'Infosec, et le scrip est chargé.

source: It will then activate at the appropriate time.
fr_fr: Il s'activera à l'heure appropriée.

source: Since Sarlo’s account did not have access rights to perform these actions, each will require an Infosec Test using Sarlo’s skill to succeed.
fr_fr: Puisque le compte de Sarlo n'a pas les droits d'acès pour effectuer ces actions, chacune d'elle nécessitera un Test d'Infosec utilisant la compétence de Sarlo pour réussir.

source: Cyberbrain Hacking
fr_fr: Piratage de Cybercerveau

source: Pods and synthmorphs (including some bots and vehicles are equipped with cybernetic brains.
fr_fr: Les pods et les synthmorphs (y compris certains véhicules) sont équipés de cerveaux cybernétiques).

source: While this technology allows a transhuman ego to sleeve into and control these forms, they carry the disadvantage of being vulnerable to hacking, like any other electronic device.
fr_fr: Alors que cette technologie permet à un ego transhumain de s'incarner dans une de ces forme et de les contrôller, elle a l'inconvénient d'être vulnérable au piratage, comme tout autre appareil électronique.

source: Cyberbrains are not wireless-enabled for security reasons, but they do have access jacks (p.
fr_fr: Les cybercerveau n'ont pas de connexion sans-fil pour dévidentes raisons de sécurité, mais ils ont des prises d'accès (p.

source: 306) and are directly linked to mesh inserts.
fr_fr: 306) et sont directement connectés aux inserts de mesh.

source: This means that in order to hack a cyberbrain, the hacker either must have direct physical access to the morph's body in order to jack in, or they must first hack into the mesh inserts and then break into the cyberbrain from there.
fr_fr: Cela veut dire que pour pirater un cybercerveau, le hackeur doit siot avoir un accès direct et physique à la morph afin de s'y brancher, ou il doit d'abord pirater l'insert de mesh puis pénétrer dans le cybercerveau.

source: Due to their importance, cyberbrains are equipped with numerous hard-coded security features that make intrusion very difficult.
fr_fr: Enr aison de leur importance, les cybercerveaux sont équipés avec de nombreuses fonctionnalités de sécurité qui rendent le sintrusion trés difficile.

source: Apply a –30 modifier to all attempts to hack into and subvert a cyberbrain.
fr_fr: Appliquez un modificateur de -30 à toutes les tentatives de pénétrer et de subvertir un cybercerveau.

source: (Note that the –30 modifier for hacking an admin account does not apply to cyberbrains.) Cyberbrains are treated just like other systems for intrusion and subversion purposes, but since they house the morph's controlling ego they present several unique hacking opportunities.
fr_fr: (Notez que le modificateur de -30 pour pirater un compte administrateur ne s'applique pas aux cybercerveaux). Les cybercerveaux sont traités comme tout les autres systèmes dans le cadre des intrusions et des subversions, mais puisqu'ils hébergent l'égo contrôllan la morph, ils présentent certains opportunités de hacking unique.

source: An intruding character can attempt to lock in an ego, preventing it from evacuating the cyberbrain.
fr_fr: Un personnage intus peut tenter d'enfermer un ego, l'empéchant d'évacuer le cybercerveau.

source: The hacker (with the –30 modifier noted above) must beat the defending character or muse in an Opposed Infosec Test.
fr_fr: Le hackeur (avec le modificateur de -30 signalé au-dessus) doit battre le personnage défenseur ou sa muse dans un Test en Opposition d'Infosec.

source: If successful, the ego is prevented from transferring itself to another system.
fr_fr: En cas de réussite, l'égo est empécher de se transférer dans un autre système.

source: To fully pen the ego in, the ego character and its protecting muse must also be locked out (p.
fr_fr: Pour bloquer complètement l'ego, le personnage de l'ego et sa muse doivent également être éjecté (p.

source: 257) from controlling the cyberbrain's system, otherwise the ego could potentially be freed.
fr_fr: 257) du système de contrôle du cybercerveau, sinon l'ego peut potentiellemnet se libérer.

source: Trapped egos are quite vulnerable.
fr_fr: Les egoos piégés de la sorte sont relativement vulnérables.

source: They could, for example, be subject to enforced uploading, enforced forking, or psychosurgery.
fr_fr: Ils peuvent, par exemple, être soumis à un upload forcé, à un fork forcé ou à de la psychochirurgie.

source: All cyberbrains incorporate mnemonic augmentation (p.
fr_fr: Tous les cybercerveaux incluent l'augmentation mnémonique (p.

source: 307), or digitally recorded memories.
fr_fr: 307), ou des souvenirs enregistrés numériquement.

source: A hacker who has accessed the cyberbrain can read, alter, or delete these memories with a successful Research or Interfacing Test (the –30 modifier applies).
fr_fr: Un hackeur qui a accès au cybercerveau peut lire, altérer ou efface ces souvenirs avec un Test de Recherche ou d'Interface réussit (le modificateur de -30 s'applique).

source: Most cyberbrains also incorporate a puppet sock (p.
fr_fr: La plupart des cybercerveaux incluent un port marionnette (p.

source: 307), enabling remote users to take over the pod or synthmorph body and control it via teleoperation or jamming (p.
fr_fr: 307), permettant aux utilisateurs distant de prendre le contrôle du pod ou de la synthmorph et de le contrôller via téléoprétaion ou interception (p.

source: This allows a hacker to seize control of the body and manipulate it remotely.
fr_fr: Cela permet au hackeur de prendre le contrôle du corp et de le manipuler à distance.

source: To do so, the hacker must take a Complex Action and beat the defending character or muse in an Opposed Infosec Test; the hacker suffers the –30 modifier noted above.
fr_fr: Pour y parvenir, le hackeur doit prendre une Action Complexe et battre le personnage en défense dans un Test en Opposition d'Infosec; le hacker subit le modificateur de -30 noté plus haut.

source: A defender who is not locked out may continue to fight for control of the morph, using a Complex Action.
fr_fr: Un défenseur qui n'est pas éjecté put continuer à se battre pour le contrôle de la morph en utilisant une Action Complexe.

source: In this case, another Opposed Infosec Test is called for.
fr_fr: Dans ce cas, il faut effectuer un autre Test en Opposition d 'Infosec.

source: This can result in a situation where the morph repeatedly slips control from the hacker to the defender, or perhaps slips into a catatonic state as the two sides battle it out.
fr_fr: Cela peut amener à des situations où la morph passe en permanence du contrôle du hacker et du défenseur, ou sombre peut-être dans un état catatonique alors que les deux parties s'affrontent.

source: Having direct access to a cyberbrain opens the possibility for certain kinds of attacks that are normally infeasible due to the strict content filtering that occurs on the link between the cyberbrain and mesh inserts.
fr_fr: Avoir un accès direct à un cybercerveau ouvre les possibilités d'un type d'attaque particulière qui sont normalement infaisable en raison du filtrage strict de contenu qui intervient entre l'insert de mesh et le cybercerveau.

source: One of these possibilities is scorching—the use of damaging neurofeedback algorithms to harm the victim's mind.
fr_fr: L'une de ces possibilités et l'écorcharge - l'utilisation d'algorithme de retour neural pour blesser l'esprit de la victime.

source: In order to make a scorching attack, the cyberbrain intruder must deploy a scorch program. To utilize a scorch program, the intruder must beat the defending Ego in an Opposed Infosec Test.
fr_fr: Afin de réussir une attaque d'écorchage, l'intrus du cybercerveau doit déployer un programme écorcheur. Pour utiliser ce programme, il doit battre l'ego défenseur dans un Test en Opposition d'Infosec.

source: The –30 modifier for cyberbrain hacking applies to the attacker.
fr_fr: Le modificateur de -30 pour pirater un cybercerveau s'applique à l'attaquant.

source: Several types of scorch programs exist, with different effects: cauterizers (damage), bedlams (stress),
fr_fr: Il xiste plusieurs type de programmes écorcheurs, chacun avec des effest différents: cautériseurs (dégats), asiles (stress),

source: spasms (pain), nightmares (fear), and shutters (sensory deprivation).
fr_fr: spasmes (douleurs), cauchemars (peur) et obturateur (privation sensorielle).

source: These are described on p.
fr_fr: Ils sont décrit p.

source: 332 of Gear.
fr_fr: 332 du chapitre Équipement.

source: If a cyberbrain is shut down (p.
fr_fr: Si un cybercerveau est éteint (p.

source: 257), the morph immediately ceases activity, perhaps collapsing or rolling to a stop.
fr_fr: 257), la morph cesse immédiatement toute activité, s'effondrant ou roulant au sol éventuellement.

source: Pods will appear to be in a coma.
fr_fr: Les pods donneront l'impression d'être dans le coma.

source: The ego, however, will be rebooted along with the cyberbrain.
fr_fr: L'ego sera cependant redémarré en même temps que le cybercerveau.

source: The cyberbrain feeds backup data to the cortical stack.
fr_fr: Le cybercerveau envoie des données à la pile corticale.

source: This is a one-way connection, so the cortical stack may not be hacked, but the transfer of data may be cut off.
fr_fr: C'est une connexion monodirectionnelle, la pile corticale ne peut donc aps être piratée, masi le transfert de donénes peut-être interrompu.

source: This termination action requires an Opposed Infosec Test between the hacker (with the –30 modifier) and the defender.
fr_fr: Cette coupure nécessite un Test en Opposition d'Infosec entre le hackeur (avec le modificateur de -30) et le défenseur.

source: The ego's backup will not be updated for as long as the connection remains off.
fr_fr: La sauvegarde de l'ego ne sera pas mise à jour tant que la connexion reste coupée.

source: Radio Jamming
fr_fr: Interception Radio
